# Погружение в Python, Часть 1. Модули, Семинар 6, hw6-2
#
# -----------------
# Задача 2:
# Добавьте в пакет, созданный на семинаре шахматный модуль.
# Внутри него напишите код, решающий задачу о 8 ферзях.
# Известно, что на доске 8×8 можно расставить 8 ферзей так,
# чтобы они не били друг друга. Вам дана расстановка 8 ферзей
# на доске, определите, есть ли среди них пара бьющих друг друга.
# Программа получает на вход восемь пар чисел, каждое число
# от 1 до 8 - координаты 8 ферзей. Если ферзи не бьют друг друга
# верните истину, а если бьют - ложь.

def is_queens_safe(queens):
    for i in range(8):
        for j in range(i + 1, 8):
            if queens[i] == queens[j] or \
               abs(queens[i][0] - queens[j][0]) == abs(queens[i][1] - queens[j][1]):
                return False
    return True


def main():
    queens = [(1, 5), (2, 3), (3, 1), (4, 7), (5, 2), (6, 8), (7, 6), (8, 4)]
    print(is_queens_safe(queens))


if __name__ == "__main__":
    main()
