# Знакомство с языком Python, Семинар 1, hw1-5
#
# -----------------
# Задача 5:
# Напишите программу, которая принимает на вход
# координаты двух точек и находит расстояние между
# ними в 2D пространстве.
#
# Пример:
# A (3,6); B (2,1) -> 5,09
# A (7,-5); B (1,-1) -> 7,21

x1 = int(input('Введите значение X для первой точки: '))
y1 = int(input('Введите значение Y для первой точки: '))
x2 = int(input('Введите значение X для второй точки: '))
y2 = int(input('Введите значение Y для второй точки: '))
dist = round(((x1 - x2) ** 2 + (y1 - y2) ** 2) ** 0.5, 2)
print(f'Расстояние между точками ({x1}; {y1}) и ({x2}; {y2}) =', dist)