# Знакомство с языком Python, Семинар 1, hw1-1
#
# -----------------
# Задача 1:
# Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли 
# этот день выходным.
# 
# Пример:
# 6 -> да
# 7 -> да
# 1 -> нет

day = int(input('Введите номер дня недели: '))
if day < 6:
    print('Нет, это рабочий день.')
elif day == 6 or day == 7:
    print('Да, это выходной.')
else:
    print('Такого дня не существует.')
    print('Повторите ввод.')
