# Погружение в Python, Часть 1. Простые типы данных, Семинар 1, hw2-1
#
# -----------------
# Задача 1:
# Напишите программу, которая получает целое число и возвращает его
# шестнадцатеричное строковое представление. Функцию hex используйте
# для проверки своего результата.

def get_number_input():
    while True:
        try:
            number = int(input("Введите целое число: "))
            return number
        except ValueError:
            print("Пожалуйста, введите корректное целое число.")
