# Данные, функции и модули в Python, Семинар 3, hw3-4
#
# -----------------
# Задача 4:
# Напишите программу, которая будет преобразовывать
# десятичное число в двоичное (без встроенных функций).
#
# Пример:
# 45 -> 101101
# 3 -> 11
# 2 -> 10

def convert_to_binary(num):
    result = ''
    while num != 0:
        result = str(num % 2) + result
        num //= 2
    return result

n = int(input('Введите десятичное число: '))
print(f'Число преобразовано в двоичное: {convert_to_binary(n)}')