# Погружение в Python, Часть 1. Основы Python, Семинар 1, hw1-1
#
# -----------------
# Задача 1:
# Треугольник существует только тогда, когда сумма любых двух его
# сторон больше третьей. Дано a, b, c - стороны предполагаемого
# треугольника. Требуется сравнить длину каждого отрезка-стороны
# с суммой двух других. Если хотя бы в одном случае отрезок окажется
# больше суммы двух других, то треугольника с такими сторонами не
# существует. Отдельно сообщить является ли треугольник разносторонним,
# равнобедренным или равносторонним.

side_a = float(input("Сторона треугольника a: "))
side_b = float(input("Сторона треугольника b: "))
side_c = float(input("Сторона треугольника c: "))

if side_a + side_b > side_c and side_a + side_c > side_b and side_b + side_c > side_a:
    if side_a == side_b == side_c:
        print("Ваш треугольник равносторонний")
    elif side_a == side_b or side_b == side_c or side_a == side_c:
        print("Ваш треугольник равнобедренный")
    else:
        print("Ваш треугольник разносторонний")
else:
    print("Треугольника с такими сторонами не существует")
