# Погружение в Python, Часть 1. Основы Python, Семинар 1, hw1-2
#
# -----------------
# Задача 2:
# Напишите код, который запрашивает число и сообщает является ли
# оно простым или составным. Используйте правило для проверки:
# "Число является простым, если делится нацело только на единицу
# и на себя". Сделайте ограничение на ввод отрицательных чисел и
# чисел больше 100 000.

def is_prime(number):
    if number <= 1:
        return False
    for i in range(2, int(number**0.5) + 1):
        if number % i == 0:
            return False
    return True
