# Погружение в Python, Часть 1. Итераторы и генераторы, Семинар 5, hw5-2
#
# -----------------
# Задача 2:
# Напишите однострочный генератор словаря, который принимает на вход три
# списка одинаковой длины: имена str, ставка int, премия str с указанием
# процентов вида 10.25%. В результате получаем словарь с именем в качестве
# ключа и суммой премии в качестве значения. Сумма рассчитывается как ставка
# умноженная на процент премии

def calculate_bonus_sum(names, wages, bonus_percents):
    return {
        name: wage + (wage * float(bonus_percent.rstrip("%")) / 100)
        for name, wage, bonus_percent in zip(names, wages, bonus_percents)
    }
