# Погружение в Python, Часть 1. Коллекции, Семинар 3, hw3-3
#
# -----------------
# Задача 3:
# Создайте словарь со списком вещей для похода в качестве ключа
# и их массой в качестве значения. Определите какие вещи влезут
# в рюкзак передав его максимальную грузоподъёмность.
# Достаточно вернуть один допустимый вариант.
# *Верните все возможные варианты комплектации рюкзака.

def generate_items():
    return {
        "tent": 50,
        "food": 20,
        "water": 30,
        "clothes": 10,
        "flashlight": 5,
        "map": 2,
        "knife": 3
    }
