# Ускоренная обработка данных: lambda, filter, map, zip, enumerate,
# list comprehension. Семинар 5, hw5-2
#
# -----------------
# Задача 2:
# Создайте программу для игры с конфетами человек против человека.
# Условие задачи: На столе лежит 2021 конфета. Играют два игрока делая ход
# друг после друга. Первый ход определяется жеребьёвкой. За один ход можно
# забрать не более чем 28 конфет. Все конфеты оппонента достаются сделавшему
# последний ход. Сколько конфет нужно взять первому игроку, чтобы забрать все
# конфеты у своего конкурента?
# a) Добавьте игру против бота.
# b) Подумайте как наделить бота "интеллектом".

from random import randint, choice

rules = ('Привет! Это игра "Забери все конфеты!" Ее основные правила: '
            'Участникам дана 2021 конфета, но за один ход можно взять не более 28.')

messages = ['Ваша очередь брать конфеты ', 'возьмите конфеты ',
            'сколько конфет возьмёте? ', 'берите, не стесняйтесь ', 'Ваш ход ']

def introduce_players():
    player1 = input('Представьтесь, пожалуйста: ')
    player2 = 'ИИ'
    print(f'Очень приятно, меня зовут {player2}')
    return [player1, player2]

def get_rules(players):
    n = 2021
    m = 28
    first = int(input(f'{players[0]}, если хотите ходить первым, нажмите 1, если нет, любую другую клавишу. '))
    if first != 1:
        first = 0
    return [n, m, int(first)]

print(rules)
players = introduce_players()
rules = get_rules(players)